{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "activation": "relu",
            "input_shape": [224, 224, 3]
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2]
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_size": [3, 3],
            "activation": "relu"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2]
          }
        },
        {
          "class_name": "Flatten",
          "config": {}
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 5,
            "activation": "linear"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": []
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.22.0",
  "convertedBy": null
}
